cases/OpenFOAM/incompressible/overPimpleDyMFoam/cylinder/cylinderAndBackground/0.orig/cellDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      cellDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    overset
    {
        patchType       overset;
        type            zeroGradient;
    }

    // Cylinder wall
    walls
    {
        type            cellMotion;
        value           $internalField;
    }

    // Outside patches
    ".*"
    {
        type            cellMotion;
        value           $internalField;
    }
}


// ************************************************************************* //
